{"class_name": "Model", "config": {"name": "model_71", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 40, 140, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_77"}, "name": "input_77", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 40, 140, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_78"}, "name": "input_78", "inbound_nodes": []}, {"class_name": "Model", "config": {"name": "model_70", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 40, 140, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_66"}, "name": "input_66", "inbound_nodes": []}, {"class_name": "Conv3D", "config": {"name": "conv3d_90", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_90", "inbound_nodes": [[["input_66", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_40", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_40", "inbound_nodes": [[["conv3d_90", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_91", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_91", "inbound_nodes": [[["leaky_re_lu_40", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_40", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_40", "inbound_nodes": [[["conv3d_91", 0, 0, {}]]]}, {"class_name": "AveragePooling3D", "config": {"name": "average_pooling3d_55", "trainable": true, "dtype": "float32", "pool_size": [1, 2, 2], "padding": "valid", "strides": [1, 2, 2], "data_format": "channels_last"}, "name": "average_pooling3d_55", "inbound_nodes": [[["dropout_40", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_60", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 20, 70, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_67"}, "name": "input_67", "inbound_nodes": []}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_25", "trainable": true, "dtype": "float32", "pool_size": [600, 20, 70], "padding": "valid", "strides": [600, 20, 70], "data_format": "channels_last"}, "name": "max_pooling3d_25", "inbound_nodes": [[["input_67", 0, 0, {}]]]}, {"class_name": "AveragePooling3D", "config": {"name": "average_pooling3d_56", "trainable": true, "dtype": "float32", "pool_size": [600, 20, 70], "padding": "valid", "strides": [600, 20, 70], "data_format": "channels_last"}, "name": "average_pooling3d_56", "inbound_nodes": [[["input_67", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_25", "layers": [{"class_name": "Flatten", "config": {"name": "flatten_25", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_60", "trainable": true, "dtype": "float32", "units": 0, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_61", "trainable": true, "dtype": "float32", "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "sequential_25", "inbound_nodes": [[["max_pooling3d_25", 0, 0, {}]], [["average_pooling3d_56", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_30", "trainable": true, "dtype": "float32"}, "name": "add_30", "inbound_nodes": [[["sequential_25", 0, 0, {}], ["sequential_25", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_25", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_25", "inbound_nodes": [[["add_30", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_50", "trainable": true, "dtype": "float32"}, "name": "multiply_50", "inbound_nodes": [[["input_67", 0, 0, {}], ["activation_25", 0, 0, {}]]]}], "input_layers": [["input_67", 0, 0]], "output_layers": [["multiply_50", 0, 0]]}, "name": "model_60", "inbound_nodes": [[["average_pooling3d_55", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_61", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 20, 70, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_68"}, "name": "input_68", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_50", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QQAAABUKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6HjxpcHl0aG9uLWlucHV0LTUtNjdj\nOGE5ZmFkYTVhPtoIPGxhbWJkYT5ZAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_50", "inbound_nodes": [[["input_68", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_51", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QQAAABUKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPoePGlweXRob24taW5wdXQtNS02N2M4\nYTlmYWRhNWE+2gg8bGFtYmRhPloAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_51", "inbound_nodes": [[["input_68", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_25", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_25", "inbound_nodes": [[["lambda_50", 0, 0, {}], ["lambda_51", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_92", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7, 7], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_92", "inbound_nodes": [[["concatenate_25", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_51", "trainable": true, "dtype": "float32"}, "name": "multiply_51", "inbound_nodes": [[["input_68", 0, 0, {}], ["conv3d_92", 0, 0, {}]]]}], "input_layers": [["input_68", 0, 0]], "output_layers": [["multiply_51", 0, 0]]}, "name": "model_61", "inbound_nodes": [[["model_60", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_93", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_93", "inbound_nodes": [[["model_61", 1, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_41", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_41", "inbound_nodes": [[["conv3d_93", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_94", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_94", "inbound_nodes": [[["leaky_re_lu_41", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_41", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_41", "inbound_nodes": [[["conv3d_94", 0, 0, {}]]]}, {"class_name": "AveragePooling3D", "config": {"name": "average_pooling3d_57", "trainable": true, "dtype": "float32", "pool_size": [1, 2, 2], "padding": "valid", "strides": [1, 2, 2], "data_format": "channels_last"}, "name": "average_pooling3d_57", "inbound_nodes": [[["dropout_41", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_62", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 10, 35, 16], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_69"}, "name": "input_69", "inbound_nodes": []}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_26", "trainable": true, "dtype": "float32", "pool_size": [600, 10, 35], "padding": "valid", "strides": [600, 10, 35], "data_format": "channels_last"}, "name": "max_pooling3d_26", "inbound_nodes": [[["input_69", 0, 0, {}]]]}, {"class_name": "AveragePooling3D", "config": {"name": "average_pooling3d_58", "trainable": true, "dtype": "float32", "pool_size": [600, 10, 35], "padding": "valid", "strides": [600, 10, 35], "data_format": "channels_last"}, "name": "average_pooling3d_58", "inbound_nodes": [[["input_69", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_26", "layers": [{"class_name": "Flatten", "config": {"name": "flatten_26", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_62", "trainable": true, "dtype": "float32", "units": 2, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_63", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "sequential_26", "inbound_nodes": [[["max_pooling3d_26", 0, 0, {}]], [["average_pooling3d_58", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_31", "trainable": true, "dtype": "float32"}, "name": "add_31", "inbound_nodes": [[["sequential_26", 0, 0, {}], ["sequential_26", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_26", "inbound_nodes": [[["add_31", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_52", "trainable": true, "dtype": "float32"}, "name": "multiply_52", "inbound_nodes": [[["input_69", 0, 0, {}], ["activation_26", 0, 0, {}]]]}], "input_layers": [["input_69", 0, 0]], "output_layers": [["multiply_52", 0, 0]]}, "name": "model_62", "inbound_nodes": [[["average_pooling3d_57", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_63", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 10, 35, 16], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_70"}, "name": "input_70", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_52", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QQAAABUKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6HjxpcHl0aG9uLWlucHV0LTUtNjdj\nOGE5ZmFkYTVhPtoIPGxhbWJkYT5ZAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_52", "inbound_nodes": [[["input_70", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_53", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QQAAABUKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPoePGlweXRob24taW5wdXQtNS02N2M4\nYTlmYWRhNWE+2gg8bGFtYmRhPloAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_53", "inbound_nodes": [[["input_70", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_26", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_26", "inbound_nodes": [[["lambda_52", 0, 0, {}], ["lambda_53", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_95", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7, 7], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_95", "inbound_nodes": [[["concatenate_26", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_53", "trainable": true, "dtype": "float32"}, "name": "multiply_53", "inbound_nodes": [[["input_70", 0, 0, {}], ["conv3d_95", 0, 0, {}]]]}], "input_layers": [["input_70", 0, 0]], "output_layers": [["multiply_53", 0, 0]]}, "name": "model_63", "inbound_nodes": [[["model_62", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_96", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_96", "inbound_nodes": [[["model_63", 1, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_42", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_42", "inbound_nodes": [[["conv3d_96", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_97", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_97", "inbound_nodes": [[["leaky_re_lu_42", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_42", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_42", "inbound_nodes": [[["conv3d_97", 0, 0, {}]]]}, {"class_name": "AveragePooling3D", "config": {"name": "average_pooling3d_59", "trainable": true, "dtype": "float32", "pool_size": [1, 2, 2], "padding": "valid", "strides": [1, 2, 2], "data_format": "channels_last"}, "name": "average_pooling3d_59", "inbound_nodes": [[["dropout_42", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_64", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 5, 17, 32], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_71"}, "name": "input_71", "inbound_nodes": []}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_27", "trainable": true, "dtype": "float32", "pool_size": [600, 5, 17], "padding": "valid", "strides": [600, 5, 17], "data_format": "channels_last"}, "name": "max_pooling3d_27", "inbound_nodes": [[["input_71", 0, 0, {}]]]}, {"class_name": "AveragePooling3D", "config": {"name": "average_pooling3d_60", "trainable": true, "dtype": "float32", "pool_size": [600, 5, 17], "padding": "valid", "strides": [600, 5, 17], "data_format": "channels_last"}, "name": "average_pooling3d_60", "inbound_nodes": [[["input_71", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_27", "layers": [{"class_name": "Flatten", "config": {"name": "flatten_27", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_64", "trainable": true, "dtype": "float32", "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_65", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "sequential_27", "inbound_nodes": [[["max_pooling3d_27", 0, 0, {}]], [["average_pooling3d_60", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_32", "trainable": true, "dtype": "float32"}, "name": "add_32", "inbound_nodes": [[["sequential_27", 0, 0, {}], ["sequential_27", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_27", "inbound_nodes": [[["add_32", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_54", "trainable": true, "dtype": "float32"}, "name": "multiply_54", "inbound_nodes": [[["input_71", 0, 0, {}], ["activation_27", 0, 0, {}]]]}], "input_layers": [["input_71", 0, 0]], "output_layers": [["multiply_54", 0, 0]]}, "name": "model_64", "inbound_nodes": [[["average_pooling3d_59", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_65", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 5, 17, 32], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_72"}, "name": "input_72", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_54", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QQAAABUKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6HjxpcHl0aG9uLWlucHV0LTUtNjdj\nOGE5ZmFkYTVhPtoIPGxhbWJkYT5ZAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_54", "inbound_nodes": [[["input_72", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_55", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QQAAABUKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPoePGlweXRob24taW5wdXQtNS02N2M4\nYTlmYWRhNWE+2gg8bGFtYmRhPloAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_55", "inbound_nodes": [[["input_72", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_27", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_27", "inbound_nodes": [[["lambda_54", 0, 0, {}], ["lambda_55", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_98", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7, 7], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_98", "inbound_nodes": [[["concatenate_27", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_55", "trainable": true, "dtype": "float32"}, "name": "multiply_55", "inbound_nodes": [[["input_72", 0, 0, {}], ["conv3d_98", 0, 0, {}]]]}], "input_layers": [["input_72", 0, 0]], "output_layers": [["multiply_55", 0, 0]]}, "name": "model_65", "inbound_nodes": [[["model_64", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_99", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_99", "inbound_nodes": [[["model_65", 1, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_43", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_43", "inbound_nodes": [[["conv3d_99", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_100", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_100", "inbound_nodes": [[["leaky_re_lu_43", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_43", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_43", "inbound_nodes": [[["conv3d_100", 0, 0, {}]]]}, {"class_name": "AveragePooling3D", "config": {"name": "average_pooling3d_61", "trainable": true, "dtype": "float32", "pool_size": [1, 2, 2], "padding": "valid", "strides": [1, 2, 2], "data_format": "channels_last"}, "name": "average_pooling3d_61", "inbound_nodes": [[["dropout_43", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_66", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 2, 8, 32], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_73"}, "name": "input_73", "inbound_nodes": []}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_28", "trainable": true, "dtype": "float32", "pool_size": [600, 2, 8], "padding": "valid", "strides": [600, 2, 8], "data_format": "channels_last"}, "name": "max_pooling3d_28", "inbound_nodes": [[["input_73", 0, 0, {}]]]}, {"class_name": "AveragePooling3D", "config": {"name": "average_pooling3d_62", "trainable": true, "dtype": "float32", "pool_size": [600, 2, 8], "padding": "valid", "strides": [600, 2, 8], "data_format": "channels_last"}, "name": "average_pooling3d_62", "inbound_nodes": [[["input_73", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_28", "layers": [{"class_name": "Flatten", "config": {"name": "flatten_28", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_66", "trainable": true, "dtype": "float32", "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_67", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "sequential_28", "inbound_nodes": [[["max_pooling3d_28", 0, 0, {}]], [["average_pooling3d_62", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_33", "trainable": true, "dtype": "float32"}, "name": "add_33", "inbound_nodes": [[["sequential_28", 0, 0, {}], ["sequential_28", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_28", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_28", "inbound_nodes": [[["add_33", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_56", "trainable": true, "dtype": "float32"}, "name": "multiply_56", "inbound_nodes": [[["input_73", 0, 0, {}], ["activation_28", 0, 0, {}]]]}], "input_layers": [["input_73", 0, 0]], "output_layers": [["multiply_56", 0, 0]]}, "name": "model_66", "inbound_nodes": [[["average_pooling3d_61", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_67", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 2, 8, 32], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_74"}, "name": "input_74", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_56", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QQAAABUKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6HjxpcHl0aG9uLWlucHV0LTUtNjdj\nOGE5ZmFkYTVhPtoIPGxhbWJkYT5ZAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_56", "inbound_nodes": [[["input_74", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_57", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QQAAABUKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPoePGlweXRob24taW5wdXQtNS02N2M4\nYTlmYWRhNWE+2gg8bGFtYmRhPloAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_57", "inbound_nodes": [[["input_74", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_28", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_28", "inbound_nodes": [[["lambda_56", 0, 0, {}], ["lambda_57", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_101", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7, 7], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_101", "inbound_nodes": [[["concatenate_28", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_57", "trainable": true, "dtype": "float32"}, "name": "multiply_57", "inbound_nodes": [[["input_74", 0, 0, {}], ["conv3d_101", 0, 0, {}]]]}], "input_layers": [["input_74", 0, 0]], "output_layers": [["multiply_57", 0, 0]]}, "name": "model_67", "inbound_nodes": [[["model_66", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_102", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_102", "inbound_nodes": [[["model_67", 1, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_44", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_44", "inbound_nodes": [[["conv3d_102", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_103", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_103", "inbound_nodes": [[["leaky_re_lu_44", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_44", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_44", "inbound_nodes": [[["conv3d_103", 0, 0, {}]]]}, {"class_name": "AveragePooling3D", "config": {"name": "average_pooling3d_63", "trainable": true, "dtype": "float32", "pool_size": [1, 2, 2], "padding": "valid", "strides": [1, 2, 2], "data_format": "channels_last"}, "name": "average_pooling3d_63", "inbound_nodes": [[["dropout_44", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_68", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 1, 4, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_75"}, "name": "input_75", "inbound_nodes": []}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_29", "trainable": true, "dtype": "float32", "pool_size": [600, 1, 4], "padding": "valid", "strides": [600, 1, 4], "data_format": "channels_last"}, "name": "max_pooling3d_29", "inbound_nodes": [[["input_75", 0, 0, {}]]]}, {"class_name": "AveragePooling3D", "config": {"name": "average_pooling3d_64", "trainable": true, "dtype": "float32", "pool_size": [600, 1, 4], "padding": "valid", "strides": [600, 1, 4], "data_format": "channels_last"}, "name": "average_pooling3d_64", "inbound_nodes": [[["input_75", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_29", "layers": [{"class_name": "Flatten", "config": {"name": "flatten_29", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_68", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_69", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "sequential_29", "inbound_nodes": [[["max_pooling3d_29", 0, 0, {}]], [["average_pooling3d_64", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_34", "trainable": true, "dtype": "float32"}, "name": "add_34", "inbound_nodes": [[["sequential_29", 0, 0, {}], ["sequential_29", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_29", "inbound_nodes": [[["add_34", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_58", "trainable": true, "dtype": "float32"}, "name": "multiply_58", "inbound_nodes": [[["input_75", 0, 0, {}], ["activation_29", 0, 0, {}]]]}], "input_layers": [["input_75", 0, 0]], "output_layers": [["multiply_58", 0, 0]]}, "name": "model_68", "inbound_nodes": [[["average_pooling3d_63", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_69", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 1, 4, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_76"}, "name": "input_76", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_58", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QQAAABUKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6HjxpcHl0aG9uLWlucHV0LTUtNjdj\nOGE5ZmFkYTVhPtoIPGxhbWJkYT5ZAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_58", "inbound_nodes": [[["input_76", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_59", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QQAAABUKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPoePGlweXRob24taW5wdXQtNS02N2M4\nYTlmYWRhNWE+2gg8bGFtYmRhPloAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_59", "inbound_nodes": [[["input_76", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_29", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_29", "inbound_nodes": [[["lambda_58", 0, 0, {}], ["lambda_59", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_104", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7, 7], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_104", "inbound_nodes": [[["concatenate_29", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_59", "trainable": true, "dtype": "float32"}, "name": "multiply_59", "inbound_nodes": [[["input_76", 0, 0, {}], ["conv3d_104", 0, 0, {}]]]}], "input_layers": [["input_76", 0, 0]], "output_layers": [["multiply_59", 0, 0]]}, "name": "model_69", "inbound_nodes": [[["model_68", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_105", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_105", "inbound_nodes": [[["model_69", 1, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_45", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_45", "inbound_nodes": [[["conv3d_105", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_106", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_106", "inbound_nodes": [[["leaky_re_lu_45", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_45", "trainable": true, "dtype": "float32", "rate": 0.6, "noise_shape": null, "seed": null}, "name": "dropout_45", "inbound_nodes": [[["conv3d_106", 0, 0, {}]]]}, {"class_name": "AveragePooling3D", "config": {"name": "average_pooling3d_65", "trainable": true, "dtype": "float32", "pool_size": [1, 1, 4], "padding": "valid", "strides": [1, 1, 4], "data_format": "channels_last"}, "name": "average_pooling3d_65", "inbound_nodes": [[["dropout_45", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_107", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_107", "inbound_nodes": [[["average_pooling3d_65", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_5", "trainable": true, "batch_input_shape": [null, 600, 1, 1, 1], "dtype": "float32", "target_shape": [600]}, "name": "reshape_5", "inbound_nodes": [[["conv3d_107", 0, 0, {}]]]}], "input_layers": [["input_66", 0, 0]], "output_layers": [["reshape_5", 0, 0]]}, "name": "model_70", "inbound_nodes": [[["input_77", 0, 0, {}]], [["input_78", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_35", "trainable": true, "dtype": "float32"}, "name": "add_35", "inbound_nodes": [[["model_70", 1, 0, {}], ["model_70", 2, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_70", "trainable": true, "batch_input_shape": [null, 600], "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_70", "inbound_nodes": [[["add_35", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_46", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_46", "inbound_nodes": [[["dense_70", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_46", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_46", "inbound_nodes": [[["leaky_re_lu_46", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_71", "trainable": true, "batch_input_shape": [null, 600], "dtype": "float32", "units": 600, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_71", "inbound_nodes": [[["dropout_46", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_47", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_47", "inbound_nodes": [[["dense_71", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_47", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_47", "inbound_nodes": [[["leaky_re_lu_47", 0, 0, {}]]]}], "input_layers": [["input_77", 0, 0], ["input_78", 0, 0]], "output_layers": [["add_35", 0, 0], ["dropout_47", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}